cf-src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf-src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf-src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf-src/CommonModules/УправлениеЗапасами/Ext/Module.bsl
#Если Сервер Тогда

Функция ПолучитьДефицитыОстатков(ТаблицаТоваров, Склад, Момент) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("КоличествоТребуется", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Колонки.Добавить("КоличествоОстаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК КоличествоТребуется
	|ПОМЕСТИТЬ ВТТоварыДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК Товары
	|ГДЕ
	|	Товары.Количество > 0
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ВТТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ВТТоварыДокумента.КоличествоТребуется КАК КоличествоТребуется,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТТоварыДокумента КАК ВТТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТТоварыДокумента)) КАК Остатки
	|		ПО ВТТоварыДокумента.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	ВТТоварыДокумента.КоличествоТребуется > ЕСТЬNULL(Остатки.КоличествоОстаток, 0)";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Момент", ?(ЗначениеЗаполнено(Момент), Момент, ТекущаяДата()));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ЕстьДефицитОстатков(ТаблицаТоваров, Склад, Момент, ЗаголовокСообщения = "", ВыводитьСообщения = Истина) Экспорт

	Дефициты = ПолучитьДефицитыОстатков(ТаблицаТоваров, Склад, Момент);
	
	Если Дефициты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВыводитьСообщения Тогда
		Если НЕ ПустаяСтрока(ЗаголовокСообщения) Тогда
			Сообщить(ЗаголовокСообщения, СтатусСообщения.Важное);
		КонецЕсли;
		
		Для каждого СтрокаДефицита Из Дефициты Цикл
			ОбщегоНазначения.СообщитьОДефиците(
				СтрокаДефицита.Номенклатура,
				СтрокаДефицита.КоличествоТребуется,
				СтрокаДефицита.КоличествоОстаток);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЕстьДефицитДляРезерва(ТаблицаТоваров, Склад, Момент, ЗаказИсключение = Неопределено, ВыводитьСообщения = Истина) Экспорт

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.КоличествоРезерв) КАК КоличествоРезерв
	|ПОМЕСТИТЬ ВТРезервДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК Товары
	|ГДЕ
	|	Товары.КоличествоРезерв > 0
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ВТРезервДокумента.Номенклатура КАК Номенклатура,
	|	ВТРезервДокумента.КоличествоРезерв КАК КоличествоРезерв,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК КоличествоУжеВРезерве
	|ИЗ
	|	ВТРезервДокумента КАК ВТРезервДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТРезервДокумента)) КАК Остатки
	|		ПО ВТРезервДокумента.Номенклатура = Остатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТРезервДокумента)
	|				И ЗаказКлиента <> &ЗаказИсключение) КАК Резервы
	|		ПО ВТРезервДокумента.Номенклатура = Резервы.Номенклатура
	|ГДЕ
	|	ВТРезервДокумента.КоличествоРезерв > (ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0))";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Момент", ?(ЗначениеЗаполнено(Момент), Момент, ТекущаяДата()));
	Запрос.УстановитьПараметр("ЗаказИсключение", ?(ЗначениеЗаполнено(ЗаказИсключение), ЗаказИсключение, Документы.ЗаказКлиента.ПустаяСсылка()));
	
	Дефициты = Запрос.Выполнить().Выгрузить();
	
	Если Дефициты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВыводитьСообщения Тогда
		Сообщить("Невозможно провести заказ: недостаточно доступного количества для резерва.", СтатусСообщения.Важное);
		
		Для каждого СтрокаДефицита Из Дефициты Цикл
			Доступно = СтрокаДефицита.КоличествоОстаток - СтрокаДефицита.КоличествоУжеВРезерве;
			Сообщить(
				СтрШаблон("Номенклатура '%1': к резерву %2, доступно %3.",
					СтрокаДефицита.Номенклатура,
					Формат(СтрокаДефицита.КоличествоРезерв, "ЧГ=15.3"),
					Формат(Доступно, "ЧГ=15.3")),
				СтатусСообщения.Важное);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ПолучитьОстаткиРезерваПоЗаказу(ТаблицаТоваров, Склад, Момент, ЗаказКлиента) Экспорт

	Результат = Новый Соответствие;
	
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТНоменклатураДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК Товары
	|;
	|
	|ВЫБРАТЬ
	|	Резервы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.РезервыТоваров.Остатки(&Момент,
	|		ЗаказКлиента = &ЗаказКлиента
	|			И Склад = &Склад
	|			И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТНоменклатураДокумента)) КАК Резервы";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Момент", ?(ЗначениеЗаполнено(Момент), Момент, ТекущаяДата()));
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Номенклатура, Выборка.КоличествоОстаток);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецЕсли
